xiao6hu/test01/USB_MIDI_UC_OS2_20191020/2.9.0/CMSIS/Driver/OTG_HS_STM32F2xx.h
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2017 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        18. September 2017
 * $Revision:    V1.10
 *
 * Project:      OTG High-Speed Driver Header for ST STM32F2xx
 * -------------------------------------------------------------------------- */

#include <stdint.h>
#include "stm32f2xx.h"
#include "stm32f2xx_hal.h"
#include "RTE_Components.h"

#include "cmsis_compiler.h"

#if  (defined ( __ARMCC_VERSION ) && ( __ARMCC_VERSION >= 6010050 ))
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wpacked"
#elif defined ( __GNUC__ )
  #pragma GCC diagnostic push
  #pragma GCC diagnostic ignored "-Wpacked"
  #pragma GCC diagnostic ignored "-Wattributes"
#endif
#ifndef   __UNALIGNED_UINT32_WRITE
  __PACKED_STRUCT T_UINT32_WRITE { uint32_t v; };
  #define __UNALIGNED_UINT32_WRITE(addr, val)    (void)((((struct T_UINT32_WRITE *)(void*)(addr))->v) = (val))
#endif
#ifndef   __UNALIGNED_UINT32_READ
  __PACKED_STRUCT T_UINT32_READ  { uint32_t v; };
  #define __UNALIGNED_UINT32_READ(addr)          (((const struct T_UINT32_READ  *)(const void*)(addr))->v)
#endif
#if   defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined ( __GNUC__ )
  #pragma GCC diagnostic pop
#endif

#include "Driver_USBH.h"
#include "Driver_USBD.h"

#ifdef    RTE_DEVICE_FRAMEWORK_CLASSIC
#include "RTE_Device.h"

// Do basic RTE configuration check
#if    (RTE_USB_OTG_HS == 1)
#if   ((RTE_USB_OTG_HS_HOST == 1) && (RTE_USB_OTG_HS_PHY == 0) && (RTE_OTG_HS_VBUS_PIN == 0))
#error  Configure VBUS Power On/Off pin for USB OTG High-speed in RTE_Device.h!
#endif
#else
#error  Enable USB OTG High-speed in RTE_Device.h!
#endif

// If Framework Classic is used create MX defines from RTE defines

#ifdef RTE_Drivers_USBD1
#define MX_USB_OTG_HS_DEVICE                    1
#endif
#ifdef RTE_Drivers_USBH1
#define MX_USB_OTG_HS_HOST                      1
#endif

#define MX_USB_OTG_HS_GPIO_PIN_(n)              GPIO_PIN_##n
#define MX_USB_OTG_HS_GPIO_PIN(n)               MX_USB_OTG_HS_GPIO_PIN_(n)

#if    (RTE_USB_OTG_HS_PHY == 0)                // Internal Full-speed PHY
#define MX_USB_OTG_HS_INT_FS_PHY               (1U)
#elif  (RTE_USB_OTG_HS_PHY == 1)                // External ULPI High-speed PHY
#define MX_USB_OTG_HS_EXT_HS_PHY               (1U)
#endif

#ifndef MX_USB_OTG_HS_INT_FS_PHY
#define MX_USB_OTG_HS_INT_FS_PHY               (0U)
#endif
#ifndef MX_USB_OTG_HS_EXT_HS_PHY
#define MX_USB_OTG_HS_EXT_HS_PHY               (0U)
#endif


#if     (RTE_USB_OTG_HS_PHY == 1)               // External ULPI High-speed PHY

// Pin USB_OTG_HS_ULPI_DIR : PI11 or PC2
#define MX_USB_OTG_HS_ULPI_DIR_Pin              PI11_PC2
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_AF          GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_Speed       GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_PuPd        GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_DIR_GPIOx            RTE_USB_OTG_HS_ULPI_DIR_PORT
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_Mode        GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_DIR_GPIO_Pin         MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_DIR_PIN)

// Pin USB_OTG_HS_ULPI_CK : PA5
#define MX_USB_OTG_HS_ULPI_CK_Pin               PA5
#define MX_USB_OTG_HS_ULPI_CK_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_CK_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_CK_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_CK_GPIOx             RTE_USB_OTG_HS_ULPI_CK_PORT
#define MX_USB_OTG_HS_ULPI_CK_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_CK_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_CK_PIN)

// Pin USB_OTG_HS_ULPI_NXT : PC3 or PH4
#define MX_USB_OTG_HS_ULPI_NXT_Pin              PC3_PH4
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_AF          GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_Speed       GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_PuPd        GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_NXT_GPIOx            RTE_USB_OTG_HS_ULPI_NXT_PORT
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_Mode        GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_NXT_GPIO_Pin         MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_NXT_PIN)

// Pin USB_OTG_HS_ULPI_D0 : PA3
#define MX_USB_OTG_HS_ULPI_D0_Pin               PA3
#define MX_USB_OTG_HS_ULPI_D0_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D0_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D0_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D0_GPIOx             RTE_USB_OTG_HS_ULPI_D0_PORT
#define MX_USB_OTG_HS_ULPI_D0_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D0_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D0_PIN)

// Pin USB_OTG_HS_ULPI_D3 : PB10
#define MX_USB_OTG_HS_ULPI_D3_Pin               PB10
#define MX_USB_OTG_HS_ULPI_D3_GPIO_AF           GPIO_AF10_OTG_HS
#define MX_USB_OTG_HS_ULPI_D3_GPIO_Speed        GPIO_SPEED_HIGH
#define MX_USB_OTG_HS_ULPI_D3_GPIO_PuPd         GPIO_NOPULL
#define MX_USB_OTG_HS_ULPI_D3_GPIOx             RTE_USB_OTG_HS_ULPI_D3_PORT
#define MX_USB_OTG_HS_ULPI_D3_GPIO_Mode         GPIO_MODE_AF_PP
#define MX_USB_OTG_HS_ULPI_D3_GPIO_Pin          MX_USB_OTG_HS_GPIO_PIN(RTE_USB_OTG_HS_ULPI_D3_PIN)

